# Brewfile — rendered by chezmoi from .chezmoitemplates/Brewfile
# Context: personal={{ .personal }} work={{ .work }} headless={{ .headless }} ephemeral={{ .ephemeral }}
#
# Segments:
#   always     — every machine
#   !headless  — machines with a GUI (fonts, flatpaks, terminal apps)
#   personal   — personal machines (notes, media, gaming, creative)
#   work       — work machines (TBD)
#   !ephemeral — persistent machines (heavier tools not worth installing on throwaway envs)

# ── Taps (always) ─────────────────────────────────────────────────────────────
{{ if not .headless -}}
tap "ublue-os/tap"
tap "ublue-os/experimental-tap"
{{ end -}}

# ── CLI tools (always) ────────────────────────────────────────────────────────

brew "mise"      # tool version manager — PRIMARY bootstrap
brew "fish"
brew "neovim"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "zoxide"
brew "starship"
brew "atuin"

{{ if not .ephemeral -}}
# ── CLI tools (!ephemeral) ────────────────────────────────────────────────────
brew "age"
brew "sops"
brew "btop"
{{ end -}}

{{ if not .headless -}}
# ── Fonts (!headless) ─────────────────────────────────────────────────────────
# Casks install to ~/.local/share/fonts/ on Linux, ~/Library/Fonts/ on macOS

# WezTerm primary fonts (wezterm.lua font_with_fallback)
cask "font-iosevka-term-nerd-font"
cask "font-iosevka"
cask "font-0xproto-nerd-font"

# Other tracked fonts
cask "font-hack-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monocraft"
cask "font-miracode"

# ── Flatpaks (!headless) ──────────────────────────────────────────────────────
# Linux only — brew bundle silently skips these on macOS

# Terminal
flatpak "org.wezfurlong.wezterm"

# Development
flatpak "dev.zed.Zed"
flatpak "io.podman_desktop.PodmanDesktop"
flatpak "org.gnome.meld"

# Utilities
flatpak "io.github.Qalculate.qalculate-qt"

# Media
flatpak "org.videolan.VLC"
flatpak "io.mpv.Mpv"
flatpak "org.rncbc.qpwgraph"

{{ if .personal -}}
# ── Flatpaks (personal + !headless) ───────────────────────────────────────────

# Security — flatpak GUI + op CLI via mise; socket fix via script _31
flatpak "com.onepassword.OnePassword"

# Notes / Productivity
flatpak "md.obsidian.Obsidian"
flatpak "org.mozilla.Thunderbird"
flatpak "org.mozilla.firefox"
flatpak "org.libreoffice.LibreOffice"

# Creative / 3D
flatpak "org.inkscape.Inkscape"
flatpak "org.freecad.FreeCAD"
flatpak "io.github.softfever.OrcaSlicer"

# Gaming (flatpak on immutable; Steam → distrobox on ublue)
flatpak "dev.vencord.Vesktop"
flatpak "com.heroicgameslauncher.hgl"
flatpak "net.lutris.Lutris"
flatpak "net.davidotek.pupgui2"
{{ end -}}

{{ if .work -}}
# ── Flatpaks (work + !headless) ────────────────────────────────────────────────
# placeholder — add work-specific GUI apps here
{{ end -}}

{{ end -}}
