# Brewfile — rendered by chezmoi from .chezmoitemplates/Brewfile
# Context: personal={{ .personal }} work={{ .work }} headless={{ .headless }} ephemeral={{ .ephemeral }}
# NOTE: flatpaks are NOT here — installed via dedicated script for batched parallel pulls.
#
# Segments:
#   always     — every machine
#   !headless  — machines with a GUI (font casks)
#   !ephemeral — persistent machines

# ── Taps ─────────────────────────────────────────────────────────────────────

# ── Taps (!headless) ──────────────────────────────────────────────────────────
{{ if not .headless -}}
tap "ublue-os/tap"
tap "ublue-os/experimental-tap"
{{ end -}}

# ── CLI tools (always) ────────────────────────────────────────────────────────

brew "mise"      # tool version manager — runtimes (go, node) + tools not in brew
brew "gh"        # GitHub CLI
brew "fish"
brew "neovim"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "zoxide"
brew "starship"
brew "atuin"
brew "bandwhich" # network utilization by process
brew "bottom"    # btm — system monitor
brew "chafa"     # terminal image viewer (used by yazi, tv)
brew "dust"      # disk usage visualizer
brew "git-delta" # delta — git diff pager
brew "gitui"     # git TUI
brew "glow"      # markdown renderer
brew "hyperfine" # CLI benchmarking
brew "jq"        # JSON processor
brew "just"      # command runner / task file
brew "lima"      # lightweight Linux VMs (agent sandboxes, dev envs)
brew "pi-coding-agent" # pi — AI coding agent (extensions via pi packages)
brew "sd"        # simpler sed
brew "television" # tv — fuzzy finder with channels
brew "yazi"      # terminal file manager

{{ if not .ephemeral -}}
# ── CLI tools (!ephemeral) ────────────────────────────────────────────────────
cask "1password-cli" # op CLI; pairs with 1Password GUI for biometric auth
brew "age"
brew "sops"
brew "btop"
brew "fnox"      # Firefox profile manager
brew "kubernetes-cli" # kubectl
brew "k9s"       # Kubernetes TUI
brew "rclone"
brew "restic"
brew "inotify-tools"
# resticprofile runs via podman quadlet — see ~/.config/containers/systemd/
{{ end -}}

{{ if .personal -}}
# ── CLI tools (personal) ──────────────────────────────────────────────────────
brew "task"      # taskwarrior — task management
{{ end -}}

{{ if not .headless -}}
# ── Fonts (!headless) ─────────────────────────────────────────────────────────
# Casks install to ~/.local/share/fonts/ on Linux

# WezTerm primary fonts (wezterm.lua font_with_fallback)
cask "font-iosevka-term-nerd-font"
cask "font-iosevka"
cask "font-0xproto-nerd-font"

# Other tracked fonts
cask "font-hack-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monocraft"
cask "font-miracode"
{{ end -}}
