# Brewfile — rendered by chezmoi from .chezmoitemplates/Brewfile
# Context: personal={{ .personal }} work={{ .work }} headless={{ .headless }} ephemeral={{ .ephemeral }}
# NOTE: flatpaks are NOT here — installed via dedicated script for batched parallel pulls.
#
# Segments:
#   always     — every machine
#   !headless  — machines with a GUI (font casks)
#   !ephemeral — persistent machines

# ── Taps ─────────────────────────────────────────────────────────────────────
tap "creativeprojects/tap"  # resticprofile

# ── Taps (!headless) ──────────────────────────────────────────────────────────
{{ if not .headless -}}
tap "ublue-os/tap"
tap "ublue-os/experimental-tap"
{{ end -}}

# ── CLI tools (always) ────────────────────────────────────────────────────────

brew "mise"      # tool version manager — PRIMARY bootstrap
brew "fish"
brew "neovim"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "zoxide"
brew "starship"
brew "atuin"

{{ if not .ephemeral -}}
# ── CLI tools (!ephemeral) ────────────────────────────────────────────────────
brew "age"
brew "sops"
brew "btop"
brew "rclone"
brew "restic"
brew "inotify-tools"
brew "creativeprojects/tap/resticprofile"
{{ end -}}

{{ if not .headless -}}
# ── Fonts (!headless) ─────────────────────────────────────────────────────────
# Casks install to ~/.local/share/fonts/ on Linux, ~/Library/Fonts/ on macOS

# WezTerm primary fonts (wezterm.lua font_with_fallback)
cask "font-iosevka-term-nerd-font"
cask "font-iosevka"
cask "font-0xproto-nerd-font"

# Other tracked fonts
cask "font-hack-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monocraft"
cask "font-miracode"
{{ end -}}
