{{ if not .headless -}}
# !headless — GUI machines
org.wezfurlong.wezterm
dev.zed.Zed
io.podman_desktop.PodmanDesktop
io.github.Qalculate
io.mpv.Mpv
io.github.dp0sk.Crosspipe
io.github.flattool.Warehouse
com.github.tchx84.Flatseal
io.github.flattool.Ignition
com.ranfdev.DistroShelf
io.github.kolunmi.Bazaar
org.localsend.localsend_app
org.gnome.Calculator
org.gnome.SimpleScan

{{ if .personal -}}
# personal
md.obsidian.Obsidian
org.mozilla.Thunderbird
org.mozilla.firefox
com.brave.Browser
org.libreoffice.LibreOffice
org.inkscape.Inkscape
org.freecad.FreeCAD
dev.vencord.Vesktop
io.github.diegopvlk.Cine
# NOTE: OrcaSlicer is NOT here — it has no Flathub remote.
# Installed via run_onchange_after_36_orcaslicer.sh.tmpl from GitHub releases.
# NOTE: 1Password (com.onepassword.OnePassword) not here — needs rpm-ostree
# overlay on immutable distros for browser integration / system auth.
{{ end -}}

{{ if .work -}}
# work — placeholder
{{ end -}}

{{ end -}}
