{{ if not .headless -}}
# !headless — GUI machines
org.wezfurlong.wezterm
dev.zed.Zed
io.podman_desktop.PodmanDesktop
org.gnome.meld
io.github.Qalculate.qalculate-qt
org.videolan.VLC
io.mpv.Mpv
org.rncbc.qpwgraph
io.github.flattool.Warehouse
com.github.tchx84.Flatseal
io.github.flattool.Ignition
com.ranfdev.DistroShelf
io.github.kolunmi.Bazaar

{{ if .personal -}}
# personal
com.onepassword.OnePassword
md.obsidian.Obsidian
org.mozilla.Thunderbird
org.mozilla.firefox
org.libreoffice.LibreOffice
org.inkscape.Inkscape
org.freecad.FreeCAD
dev.vencord.Vesktop
com.heroicgameslauncher.hgl
net.lutris.Lutris
net.davidotek.pupgui2
io.github.diegopvlk.Cine
# NOTE: OrcaSlicer is NOT here — it has no Flathub remote.
# Installed via run_always_after_36_orcaslicer.sh.tmpl from GitHub releases.
{{ end -}}

{{ if .work -}}
# work — placeholder
{{ end -}}

{{ end -}}
