awinecki/fish-kubecolor-completions
decors/fish-colored-man
edc/bass
evanlucas/fish-kubectl-completions
franciscolourenco/done
jorgebucaran/autopair.fish
jorgebucaran/fisher
jorgebucaran/spark.fish
kidonng/zoxide.fish
nickeb96/puffer-fish
oh-my-fish/plugin-bang-bang
patrickf3139/fzf.fish
wfxr/forgit
